OdGeInterval.isPeriodicallyOn(System.Double,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the specified value is periodically on this Interval.
\remarks
Returns true if and only if there is a positive integer N such that
value + N * period
is on this Interval. If so, returns that value.
\param period [in]  Period.
\param value [in/out] Value.

OdGeInterval.op_Inequality(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeInterval object.
\returns
A boolean value that indicates whether the input interval is not identical to this interval.

OdGeInterval.op_Equality(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeInterval object.
\returns
A boolean value that indicates whether the input interval is identical to this interval.

OdGeInterval.contains(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if this interval contains the specified value or Interval.
\remarks
Returns true if and only if this Interval contains value or otherInterval within tolerance().
\param otherInterval [in]  The Interval to be tested.
\param value [in]  The value to be tested.

OdGeInterval.finiteIntersectWith(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Find finite sub-interval belonging both to the specified range and this one
\returns
Returns true if and only if the specified interval intersects with this one,
and the resulting interval is bounded.
\param range [in]  The interval to be intersected.
\param result [out]  Receives the intersected interval.

OdGeInterval.intersectWith(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Intersects the specified interval from this one.
\returns
Returns true if and only this specified interval intersects with this one,
and the interval of intersection.
\param otherInterval [in]  The interval to be intersected.
\param result [out]  Receives the intersected interval.

OdGeInterval.subtract(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Subtracts the specified interval from this interval.
\returns
Returns the number of intervals, and the intervals, resulting from the subtraction
\param otherInterval [in]  The interval to be subtracted from this one.
\param lInterval [out]  Receives the Left (or only) interval.
\param rInterval [out]  Receives the right interval.
\remarks
return value   Results
0              Empty result
1              Single interval in lInterval
2              Left in lInterval, Right in rInterval.

OdGeInterval.setTolerance(System.Double)
\details
Sets the boundary tolerance for this interval.
\param tol [in]  Boundary tolerance.
\returns
Returns a reference to this interval.

OdGeInterval.setLower(System.Double)
\details
Sets the lower bound for this interval.
\param lower [in] Lower bound.
\returns
Returns a reference to this interval.

OdGeInterval.set
\details
Unbounds this interval.
\returns
Returns a reference to this interval.

OdGeInterval.set(System.Boolean,System.Double)
\details
Sets the parameters for this interval according to the arguments.
\param boundedBelow [in]  Determines if bound specifies a lower or an upper bound.
\param bound [in]  Specifies a lower bound if boundedBelow is true, or an upper
bound if it is false.
\returns
Returns a reference to this interval.

OdGeInterval.set(System.Double,System.Double)
\details
Sets the parameters for this interval according to the arguments.
\param lower [in]  Lower bound.
\param upper [in]  Upper bound.
\returns
Returns a reference to this interval.

OdGeInterval.eval(System.Double)
\details
Returns parameter L + (R-L) * t for given ratio t.
Note: if the interval is unbounded, behavior is undefined!
\param ratio  Arbitrary number

OdGeInterval.length
\details
Returns the length of this interval.
\returns
Returns -1.0 if this interval is unbounded above or below.